{
  "manifestInfo": {
    "description": "Authoritative manifest for the PM Service Planner – Branch Automation Suite. Drives the Information tab inside the bound Google Sheet and documents metadata, architecture, features, roadmap, limitations, and version history. Structured for both machine parsing and human reading.",
    "organization": {
      "rootLevelKeys": [
        "title",
        "author",
        "license",
        "version",
        "releaseDate",
        "repo",
        "overview",
        "architecture",
        "features",
        "planned",
        "limitations",
        "versionHistory",
        "notes",
        "metadata"
      ]
    }
  },

  "title": "PM Service Planner – Branch Automation Suite",
  "author": "Austin Monson",
  "license": "MIT",
  "version": "1.8.28",
  "releaseDate": "2025-11-06",
  "repo": "https://github.com/austinm-hayden/googlesheets.git",

  "overview": [
    "The PM Service Planner automates preventive maintenance management for Hayden Machinery’s equipment fleet.",
    "It is now fully functional — enabling direct upload of raw INCUS5 export data, automatic organization of machines by branch, and automatic sorting by overdue hours to prioritize work.",
    "Each branch tab includes a Due dropdown and Notes field for research and confirmation of service eligibility, allowing service teams to document machine readiness and status in one unified view.",
    "All formatting, validation, and conditional color rules are inherited dynamically from the Springfield template, ensuring uniform appearance and functionality across branches.",
    "Automatic archive and restore features safeguard previous revisions, while the Information tab provides live build metadata and GitHub versioning traceability."
  ],

  "architecture": {
    "coreComponents": {
      "DataProcessor": "Converts uploaded .xlsx via Drive API v2, normalizes headers, splits machines by Branch, and sorts by Overdue value descending.",
      "TemplateClonerCFReplicator": "Copies Springfield template and replicates all dropdowns, validations, and conditional-formatting rules.",
      "CarryoverEngine": "Preserves Due and Notes per Stock # to maintain service context between uploads.",
      "ArchiveManager": "Creates timestamped hidden backups before rebuild and exposes a restore workflow.",
      "SheetCleaner": "Deletes stray 'Copy of …' sheets post-copy to keep workbook tidy.",
      "DialogInterface": "Container-bound modals for Upload and Restore actions (no web app deploy required).",
      "InformationTabBuilder": "Pulls this manifest and latest commit SHA to build the in-sheet readme tab.",
      "GitHubSync": "Fetches remote JSON and commit data via UrlFetchApp.",
      "LoggingSystem": "Streams status updates to CacheService for live progress feedback."
    }
  },

  "features": [
    "Fully functional spreadsheet workflow from upload to branch tab generation.",
    "Automated import and normalization of raw INCUS5 exports.",
    "Branch-based tab organization (Springfield, West Plains, Villa Ridge).",
    "Automatic sorting by Overdue hours for quick prioritization.",
    "Persistent Due/Notes carryover by Stock # across revisions.",
    "Dynamic dropdowns and color-changing Due column via template CF rules.",
    "Archive creation and restore dialog with hidden snapshot storage.",
    "Progress tracking via CacheService and responsive upload dialog.",
    "Information tab auto-generated from GitHub manifest and commit data.",
    "Auto-cleanup of stray 'Copy of …' tabs and case-insensitive dialog lookup.",
    "Drive API v2 conversion with polling for reliability and error safety."
  ],

  "planned": [
    "Add calendar/email integration for Due = 'Available - Immediate Service'.",
    "Expose Overdue cutoff and Due filter patterns as editable configuration.",
    "Develop a 'Top 20 Overdue Machines' summary per branch.",
    "Add optional archive pruning (keep last N archives per branch).",
    "Support direct Drive file watch for INCUS5 exports.",
    "Implement release automation to increment manifest version and rebuild info tab."
  ],

  "limitations": [
    "Requires initial authorization for Drive, Spreadsheet, and UrlFetch scopes.",
    "Advanced Google Services → Drive API v2 and Cloud Drive API must be enabled.",
    "Bound modal dialogs only (cannot run via simple triggers).",
    "Apps Script execution-time quotas may limit very large datasets.",
    "Formatting behavior depends on the Springfield template configuration."
  ],

  "versionHistory": [
    {
      "version": "1.8.28",
      "date": "2025-11-06",
      "summary": "Functional release – branch organization, overdue sorting, research-ready.",
      "changes": [
        "Enabled direct INCUS5 raw upload and full branch automation.",
        "Added overdue-hours sort and streamlined Notes workflow.",
        "Retained dropdown CF for live Due color response.",
        "Confirmed complete menu and archive/restore functionality."
      ]
    }
  ],

  "notes": [
    "Semantic versioning follows MAJOR.MINOR.PATCH.",
    "Template sheet defines dropdowns and conditional formatting; all branches inherit it.",
    "Keep one authoritative script file to avoid shadowing functions.",
    "This manifest is consumed by buildInformationTab() for automatic documentation."
  ],

  "metadata": {
    "lastBuild": "2025-11-06T00:00:00-06:00",
    "sourceCommit": "auto-filled by buildInformationTab() via GitHub API",
    "buildEnvironment": "Google Apps Script (Bound Spreadsheet Project)",
    "maintainer": "Austin Monson <austinm@myhayden.com>"
  }
}
